Extensions/УВМ/Documents/ПриемНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриемНаРаботу</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_Разряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УВМ_Разряды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/УВМ/Documents/ПриемНаРаботу/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура УВМ_ОбработкаПроведения(Отказ, РежимПроведения)

	Документы.ПриемНаРаботу.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

	#Вставка
	//++dar 20221128 (11805)
	Если НЕ Отказ Тогда
		Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду("851027ec-d2af-4799-bb1e-6aeedfaab22f");
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Сотрудник);	
	КонецЕсли;
	//--dar 20221128 (11805)
	
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_КэшированиеЗначений.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		ТаблицаДвижений = Новый ТаблицаЗначений;
		ТаблицаДвижений.Колонки.Добавить("Период");
		ТаблицаДвижений.Колонки.Добавить("Физлицо");
		ТаблицаДвижений.Колонки.Добавить("Руководитель");
		ТаблицаДвижений.Колонки.Добавить("КадровыйДокумент");
		
		НовДвижение = ТаблицаДвижений.Добавить();
		НовДвижение.Период = ДатаПриема;
		НовДвижение.Физлицо = ФизическоеЛицо;
		НовДвижение.Руководитель = УВМ_Руководитель;
		НовДвижение.КадровыйДокумент = Ссылка;
		
		УВМ_ОбщиеДоработки.СформироватьДвиженияПоРуководителям(ТаблицаДвижений);
	КонецЕсли;
	//--dar 25.06.25 (255715)
	#КонецВставки

КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура УВМ_ОбработкаУдаленияПроведения(Отказ)
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_КэшированиеЗначений.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		УВМ_ОбщиеДоработки.УдалитьДвиженияПоРуководителям(Ссылка);
	КонецЕсли;	
	//--dar 25.06.25 (255715)
КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура УВМ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//++dar 31.05.24 (183874)
	Если Дата >= УВМ_ОбщиеДоработки.ПолучитьДатуНачалаУчетаРМ() Тогда
		ПроверяемыеРеквизиты.Добавить("РабочееМесто");
	КонецЕсли;
	//--dar 31.05.24 (183874)

	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_КэшированиеЗначений.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		ПроверяемыеРеквизиты.Добавить("УВМ_Руководитель");
	КонецЕсли;
	//--dar 25.06.25 (255715)

КонецПроцедуры
